org/conao3.org
#+title: Hugo blog source
#+author: conao3
#+date: <2020-05-05 Tue>
#+options: ^:{}

#+hugo_base_dir: ../

#+link: files file+sys:../static/files/

** DONE License                                                  :meta:hugo:
CLOSED: [2020-05-05 Tue 17:36]
:PROPERTIES:
:EXPORT_FILE_NAME: license
:EXPORT_DATE: 2020-05-05T00:00:00+09:00
:EXPORT_HUGO_LASTMOD: [2020-05-05 Tue 16:20]
:END:

*** License
- All articles (sentence) are distributed under [[https://creativecommons.org/licenses/by/4.0/legalcode.txt][CC BY]].
  #+begin_example
  Creative Commons Attribution 4.0 International Public License (CC BY)
  Copyright (c) Hiroshima.lisp - https://lisp.netlify.app
  https://creativecommons.org/licenses/by/4.0/legalcode
  #+end_example
- All source code are distributed under [[https://creativecommons.org/publicdomain/zero/1.0/legalcode.txt][CC0]].
- All cited source code respects the license of the cited source.
  - [[https://www.gnu.org/licenses/gpl-3.0.txt][GPLv3]] - Emacs related source code.
  - MIT

*** Dependent materials/sources license
- Hiroshima.lisp icon made by [[https://www.flaticon.com/authors/freepik][freepik]] from [[https://www.flaticon.com/][www.flaticon.com]] ([[https://www.freepikcompany.com/legal][Term of use]]).
- [[https://fontawesome.com/][Font Awesome]] - [[http://scripts.sil.org/OFL][SIL OFL 1.1]]
- [[https://feathericons.com/][Feather icons]] - [[https://github.com/feathericons/feather/blob/master/LICENSE][MIT]]
- [[https://jquery.org/][jQuery]] - [[https://jquery.org/license/][MIT]]
- [[https://getbootstrap.com/][Bootstrap]] - [[https://github.com/twbs/bootstrap/blob/v4.0.0/LICENSE][MIT]]
- [[https://gohugo.io/][Hugo]] - [[https://gohugo.io/about/license/][Apache 2.0]]
- [[https://golang.org/][Go]] - [[https://golang.org/LICENSE][BSD]]

*** Using Hugo blog theme
- [[https://github.com/conao3/anatole-ext][conao3/anatole-ext]] - [[https://github.com/conao3/anatole-ext/blob/master/LICENSE][MIT]]

*** Respected Hugo blog theme
- [[https://github.com/lxndrblz/anatole][lxndrblz/anatole]] - [[https://github.com/lxndrblz/anatole/blob/master/LICENSE][MIT]]
- [[https://github.com/hi-caicai/farbox-theme-Anatole][hi-caicai/farbox-theme-Anatole]] - [[https://github.com/hi-caicai/farbox-theme-Anatole][MIT]]
- [[https://github.com/kbaidya21/liva-hugo][kbaidya21/liva-hugo]] - [[https://github.com/kbaidya21/liva-hugo/blob/master/LICENSE][MIT]]

