content/blog/license.md
---
title: "License"
author: ["conao3"]
date: 2020-05-05T17:36:00+09:00
lastmod: 2020-05-05T16:20:00+09:00
tags: ["meta", "hugo"]
draft: false
---

## License {#license}

-   All articles (sentence) are distributed under [CC BY](https://creativecommons.org/licenses/by/4.0/legalcode.txt).

    ```text
    Creative Commons Attribution 4.0 International Public License (CC BY)
    Copyright (c) Hiroshima.lisp - https://lisp.netlify.app
    https://creativecommons.org/licenses/by/4.0/legalcode
    ```
-   All source code are distributed under [CC0](https://creativecommons.org/publicdomain/zero/1.0/legalcode.txt).
-   All cited source code respects the license of the cited source.
    -   [GPLv3](https://www.gnu.org/licenses/gpl-3.0.txt) - Emacs related source code.
    -   MIT


## Dependent materials/sources license {#dependent-materials-sources-license}

-   Hiroshima.lisp icon made by [freepik](https://www.flaticon.com/authors/freepik) from [www.flaticon.com](https://www.flaticon.com/) ([Term of use](https://www.freepikcompany.com/legal)).
-   [Font Awesome](https://fontawesome.com/) - [SIL OFL 1.1](http://scripts.sil.org/OFL)
-   [Feather icons](https://feathericons.com/) - [MIT](https://github.com/feathericons/feather/blob/master/LICENSE)
-   [jQuery](https://jquery.org/) - [MIT](https://jquery.org/license/)
-   [Bootstrap](https://getbootstrap.com/) - [MIT](https://github.com/twbs/bootstrap/blob/v4.0.0/LICENSE)
-   [Hugo](https://gohugo.io/) - [Apache 2.0](https://gohugo.io/about/license/)
-   [Go](https://golang.org/) - [BSD](https://golang.org/LICENSE)


## Using Hugo blog theme {#using-hugo-blog-theme}

-   [conao3/anatole-ext](https://github.com/conao3/anatole-ext) - [MIT](https://github.com/conao3/anatole-ext/blob/master/LICENSE)


## Respected Hugo blog theme {#respected-hugo-blog-theme}

-   [lxndrblz/anatole](https://github.com/lxndrblz/anatole) - [MIT](https://github.com/lxndrblz/anatole/blob/master/LICENSE)
-   [hi-caicai/farbox-theme-Anatole](https://github.com/hi-caicai/farbox-theme-Anatole) - [MIT](https://github.com/hi-caicai/farbox-theme-Anatole)
-   [kbaidya21/liva-hugo](https://github.com/kbaidya21/liva-hugo) - [MIT](https://github.com/kbaidya21/liva-hugo/blob/master/LICENSE)
